{"backend": "tensorflow", "config": [{"config": {"name": "global_average_pooling2d_2", "batch_input_shape": [null, 5, 5, 2048], "dtype": "float32", "data_format": "channels_last", "trainable": true}, "class_name": "GlobalAveragePooling2D"}, {"config": {"name": "dropout_5", "rate": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "dense_5", "bias_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "units": 2048, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "dropout_6", "rate": 0.3, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "dense_6", "bias_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "units": 1024, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "dropout_7", "rate": 0.3, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "dense_7", "bias_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "activation": "softmax", "bias_regularizer": null, "units": 133, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "trainable": true}, "class_name": "Dense"}], "keras_version": "2.0.0", "class_name": "Sequential"}